# Проект FitLife - MVP версия 1.0.
print("~" * 79, end="\n")

# 1. Приветствие.

print("Добро пожаловать! Я фитнес-бот компании FitLife.")
print("Я помогу вам расчитать ИМТ (Индекс Массы Тела)")
print("и подберу для вас индивидуальную фитнес программу.")
print("C FitLife вас ждет невероятное преображение! Давайте скорее начнём!")


# 2. Сбор данных.

# Спрашиваем у пользователя имя:
user_name = input("Как можно к вам обращаться? ")
print(f"Очень приятно, {user_name}!")

# Используем while True/try/exept при возможном некорректном вводе данных
# пользователем (типа данных str вместо int):

# Возраст:
while True:
    try:
        user_age = int(input("Сколько вам лет? "))  # Спрашиваем возраст
        # и преобразуем полученные данные в число
        break
    except ValueError:
        print("При указании возраста, пожалуйста, используйте числа.")
print("Самый расцвет!")

# Вес:
while True:
    try:
        user_weight = float(input("Введите свой вес в кг, (напр., 55.5): "))
        # Спрашиваем у пользователя его вес
        # и преобразуем полученные данные в число
        break
    except ValueError:
        print(f"{user_name}, пожалуйста, используйте числа.")

# Рост:
while True:
    try:
        # Спрашиваем у пользователя его рост:
        user_height = input(
            "Укажите ваш рост в метрах, используя точку (напр., 1.75): ")
        # Сохраняем в user_height (тип float):
        user_height = float(user_height)
        break
    except ValueError:
        print("При указании роста, пожалуйста, используйте числа.")


# 3. Расчёты.

# Константы для расчёта ИМТ (BMI):
UNDERWEIGHT_THRESHOLD = 18.5     # Порог дефицита массы тела
NORMAL_WEIGHT_THRESHOLD = 25.0   # Порог нормального веса
OVERWEIGHT_THRESHOLD = 30.0      # Порог избыточного веса

# Константы для расчёта нормы потребления воды человеком:
WATER_PER_KG = 30  # Норма потребления воды на 1 кг
ONE_LITER = 1000  # В 1 литре 1000 мл воды


# Производим расчет ИМТ (Индекса Массы Тела):
# Результат округляем до одного знака после запятой:
body_mass_index = round((user_weight / (user_height ** 2)), 1)

# Производим подсчет воды и переводим в литры:
water_needed = (user_weight * WATER_PER_KG) / ONE_LITER


# 4. Вывод красивого результата.

print("~ " * 40, end="\n")
print("| Таа-даааам! |")
print("~ " * 40, end="\n")
print(f"{user_name}, индекс массы вашего тела")
print(f"(ИМТ) равен {body_mass_index}")


if body_mass_index < UNDERWEIGHT_THRESHOLD:
    print("У вас дефицит массы тела.")
    print('FitLife рекомендует вам "Программу набора мышечной массы".')
if 18.5 <= body_mass_index <= NORMAL_WEIGHT_THRESHOLD:
    print("Замечательно! Ваш вес в норме.")
    print('FitLife рекомендует вам')
    print('"Программу оздоровления и поддержания веса".')
if body_mass_index > NORMAL_WEIGHT_THRESHOLD:
    print("У вас есть избыточный вес.")
    print('FitLife рекомендует вам "Программу сброса лишнего веса".')
print(f"Ваша дневная норма потребления воды: {water_needed} л.")
print(f"{user_name}, желаю вам вдохновляющего преображения!")
print("Ваш верный фитнес помощник – бот FitLife.")
print("~" * 79, end="\n")
