# Проект FitLife - MVP версия 1.0.

# 1. Приветствие.
print("Добро пожаловать! Я фитнес-бот компании FitLife.")
print(" ")
print("Я помогу вам расчитать ИМТ (Индекс Массы Тела).")
print("А также я подберу для вас индивидуальную фитнес программу.")
print("C FitLife вас ждет невероятное преображение! Давайте скорее начнём 🪄")
# Добавим немного волшебства..
print("✨✨✨")

# 2. Сбор данных.
# Спрашиваем у пользователя имя:
user_name = input("Как можно к вам обращаться? ")
print(f"Очень приятно, {user_name}!")

# Спрашиваем возраст и преобразуем полученные данные в число:
user_age = int(input("Сколько вам лет? "))

# Спрашиваем у пользователя его вес:
user_weight = float(input("Введите свой вес в кг, (напр., 55.5): "))

# Спрашиваем у пользователя рост и сохраняем в user_height (тип float):
user_height = input("Напишите ваш рост в м, используя точку (напр., 1.75): ")
user_height = float(user_height)

# 3. Расчёты.
# Производим расчет ИМТ (Индекса Массы Тела):
# Результат округляем до одного знака после запятой:
body_mass_index = round((user_weight / (user_height ** 2)), 1)

# Производим подсчет воды: вес * 30 мл:
water_needed = (user_weight * 30) / 1000


# 4. Вывод красивого результата.
print(" ")
print("✨Таа-даааам!✨")
print(" ")
print(f"{user_name}, индекс массы вашего тела")
print(f"(ИМТ) равен {str(body_mass_index)}")
print(" ")

if body_mass_index < 18.5:
    print("У вас дефицит массы тела.")
    print('FitLife рекомендует вам "Программу набора мышечной массы".')
if 18.5 <= body_mass_index < 24.9:
    print("Замечательно! Ваш вес в норме.")
    print('FitLife рекомендует вам')
    print('"Программу оздоровления и поддержания веса".')
if body_mass_index >= 25:
    print("У вас есть избыточный вес.")
    print('FitLife рекомендует вам "Программу сброса лишнего веса".')
print(f"💧 Ваша дневная норма потребления воды: {str(water_needed)} л.")
print(" ")
print("✨✨✨")
print(f"{user_name}, желаю вам вдохновляющего преображения!")
print("💚 Ваш верный фитнес помощник – бот FitLife.")
print(" ")
print("~" * 45, end="\n")
